<a href="https://colab.research.google.com/github/Swapn2/Data-Science-Learnings/blob/main/panda_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

https://pandas.pydata.org/about/index.html

### Pandas Series

A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

In [3]:
import pandas as pd
import numpy as np

## series from the list

In [5]:
country = ['India',"pakistan",'srilanka','Nepal','japan']
pd.Series(country)

0       India
1    pakistan
2    srilanka
3       Nepal
4       japan
dtype: object

In [7]:
# integer
runs = [13,52,85,56,32,]
pd.Series(runs)

0    13
1    52
2    85
3    56
4    32
dtype: int64

In [8]:
# custom index
marks = [13,52,85,56]
subject = ['hindi','english','maths','science']

pd.Series(marks,index=subject)

hindi      13
english    52
maths      85
science    56
dtype: int64